[
  {
    "id": "ford-drive",
    "title": "Ford Built Wild & Built to Electrify",
    "body": "<p>When autoshows returned after Covid during the summer of 2021, Ford wanted to make a big impression for its flashiest cars - the Bronco and the Mach-E.</p><p>The Bronco draws customers in because of its off-roading capabilities. So to demonstrate all it could do, Ford built an obstacle course ending with “The Mountain” where they could show off the Bronco’s peak incline and decline angles.</p><p>The Mach-E is Ford’s electric sports car with an impressive ability to accelerate from 0-60 in 3.5 seconds. So similar to the Bronco, they built a runway for drivers to show this acceleration and the car at peak performance.</p><p>In both cases, Ford wanted customers to have a souvenir to go home with. So we built an application that records visitors’ reaction at the exact moment of surprise and delight and programmatically edit the video for a keepsake they could view and share afterwards.</p>",
    "heroPos": "center 35%",
    "employer": "Imagination",
    "client": "Ford",
    "date": "July 2021 - Present",
    "role": "Fullstack Developer, Onsite Support",
    "skills": "Python, Angular, Scss, Node.js, Next.js, RabbitMQ, MySql",
    "sections": [
      {
        "layout": "video",
        "video": "mache.mp4",
        "backgroundColor": "#191c23"
      },
      {
        "layout": "text",
        "title": "Technical Details",
        "body": "<p>The goal of the project was get clips of video on peak acceleration for the Mach-E and peak incline/decline for the Bronco.</p><p>In order to do this, we had an accelerometer and gyroscope in the trunk of each car. We used a python script on a raspberry pi to read and process these numbers continuously. We used the accelerometer readings directly for the Mach-E, but the Bronco needed data on the incline angle of the car, so we used the data from both sensors and the complimentary filter to combine them into incline angle.</p><p>All this data is then sent off to the video recording application running on a laptop, also in stored in the trunk of the car. The application was an Angular application connected to a webcam in order to start and stop the recording. It recorded time stamps as incline and acceleration thresholds were passed. The video and timestamps were then passed off to the video processing application on the backend.</p><p>We had a physical server on site to run the backend, the video processing application itself was run in a docker container on a virtual machine on that server. The application used a node backend to queue jobs using rabbitmq as they came in from the frontend and a node worker to process each job. Most of the work done by the worker used ffmpeg - it was used to splice the video at the given timestamps, add clips of stock video, audio, and a layover.  It then sent the final product to Amazon S3 for storage and an email to the user for them to view and share.</p>",
        "backgroundColor": "#EBECED",
        "textColor": "#667084"
      },
      {
        "layout": "background-image",
        "backgroundImage": "background-1.png",
        "backgroundPos": "center 40%"
      },
      {
        "layout": "text",
        "title": "Outcome",
        "body": "<p>Coming Soon</p>",
        "backgroundColor": "#191c23",
        "textColor": "#ffffff"
      },
      {
        "layout": "video",
        "video": "bronco.mp4",
        "backgroundColor": "#ebeced"
      }
    ]
  },
  {
    "id": "canon-photobooth",
    "title": "Canon Photo Booth Experience",
    "body": "<p>For CES 2020, Canon had plans to create a flashy centralized runway lined with camera stands to give participants the opportunity to demo their cameras and compare Canon’s offerings. However, they wanted to make the experience more personalized, so we added a digital component to the activation that would allow the participants to save their images to their Canon Passport profile. With this functionality, user were able to revisit the photos to take a closer look after the show, as well as allow Canon to keep in contact with the leads they collected from the stand.</p><p>We went with this particular application for two reasons - it enhanced the participant experience by keeping them engaged in the content and giving them something to take home and it also drew attention to Canon’s Software Developer Kit for those who wanted to get into more of the technical aspects of their camera.</p>",
    "heroPos": "59% center",
    "skills": "Angular, Scss, C++, Nodejs",
    "employer": "Imagination",
    "client": "Canon",
    "date": "November 2019 - January 2020",
    "role": "Fullstack Developer, Onsite Support",
    "sections": [
      {
        "layout": "background-image",
        "backgroundImage": "content-image-1.png"
      },
      {
        "layout": "text",
        "title": "Technical Details",
        "body": "<p>The Photo Booth experience was a collection of applications that facilitated capturing, saving, and printing images. The user would scan their QR code and take a pictures using one of Canon’s premium DSLR cameras. The image would then appear on the tablet and give them the option to either save the picture or retake it. Once the user saved the image, it would be saved to their passport, and they also had the option to print it on one of Canon’s display printers.</p><p>To achieve that user experience, we built a backend application that used Canon’s SDK and acted as a bridge between the camera and the frontend tablet. We had a second backend application for the printer service as the point of connection to the printers. Lastly, the frontend tablet interfaced with both backend services, as well as xpkit. </p>",
        "backgroundColor": "#EBECED",
        "textColor": "#667084"
      },
      {
        "layout": "image",
        "image": "content-image-2.png",
        "backgroundColor": "#191C23"
      }
    ]
  },
  {
    "id": "aptiv-sva",
    "title": "Aptiv Virtual Tool",
    "skills": "Angular, Scss, ThreeJS, Augmented Reality",
    "employer": "Imagination",
    "client": "Aptiv",
    "date": "October 2020 - Present",
    "role": "Frontend Developer",
    "heroPos": "84% 70%",
    "body": "<p>As a result of the Covid-19 pandemic, many companies had to switch their strategies from physical , in-person events to online virtual events - Aptiv was no exception. To stand out in the sea of virtual events that took over the industry, we created a fully immersive, augmented reality tool to showcase Aptiv’s complex offerings and bring a surprise-and-delight factor to the regular virtual meeting.</p><p>The goal was to mimic a hands-on experience, giving users a 360 degree view of their smart vehicle architecture and allowing them to click on hotspots to zero in on individual parts of the technology. Each hotspots features a 3D model for users to manipulate on their own screen or launch in AR to see them in their own environment.</p>",
    "sections": [
      {
        "layout": "image",
        "image": "mockup.png",
        "backgroundColor": "#191C23"
      },
      {
        "layout": "text",
        "title": "Technical Details",
        "body": "<p>The application was built with Angular as the framework, google’s modelviewer for the augmented reality piece, and threejs to handle the 3d models, hotspots, and animations. It’s completely responsive to all screen sizes, and the call to action for the augmented reality will either render a QR code to scan or a button to click depending on if the device has the required hardware for AR. We completed the first phase of the project in October 2020 and continue to iterate as the client finds more uses for the tool.</p>",
        "backgroundColor": "#EBECED",
        "textColor": "#667084"
      },
      {
        "layout": "background-image",
        "backgroundImage": "mockup-2.png"
      },
      {
        "layout": "text",
        "title": "Outcome",
        "body": "<p>Coming Soon</p>",
        "backgroundColor": "#EBECED",
        "textColor": "#667084"
      },
      {
        "backgroundImage": "placeholder-background.png",
        "layout": "quote",
        "quote": "I want to recognize Imagination for […] helping us find innovative solutions for how we can reach our customers, not only from taking a physical product to a digital solution, but also helping bring that technology to life by doing event remotely by applying different types of digital tools to make it engaging.",
        "speaker": "Rachelle Valdez Vice President, Marketing and Communications, Americas at Aptiv"
      }
    ]
  },
  {
    "id": "ford-specpods",
    "heroPos": "37% 100%",
    "title": "Ford & Lincoln Mobile Spec Pods",
    "role": "Fullstack Developer",
    "employer": "Imagination",
    "client": "Ford / Lincoln",
    "date": "July 2021 - Present",
    "skills": "Angular, Scss, Django, Ansible, Docker",
    "body": "<p>Upon the return of auto shows during the summer of 2021, one of Ford’s goals was to make vehicle information on the stand more accessible and easier to navigate. Normally spec information is put on a tablet in front of the vehicle. However, this limits the interactions visitors have with the app and also allows for only one user at a time.</p><p>So for the new season of auto shows, we built Ford’s new mobile spec pods. Visitors can scan a QR code and interact with the information on their own devices, as well as explore additional information using links within the application. Not only does this make the app more user friendly, but it also eliminates the need for community tablets - a practice that has been frowned upon since the pandemic began.</p><p>Since the launch of the mobile spec pods, we have now expanded the application to have a variety of versions and styles depending on the needs of a given show.</p>",
    "sections": [
      {
        "layout": "image",
        "image": "mockup-2.png",
        "backgroundColor": "#191C23"
      },
      {
        "layout": "text",
        "title": "Technical Details",
        "body": "<p>Coming Soon</p>",
        "backgroundColor": "#EBECED",
        "textColor": "#667084"
      },
      {
        "layout": "background-image",
        "backgroundImage": "mockup-1.png",
        "backgroundPos": "100% 20%"
      }
    ]
  },
  {
    "id": "saudi",
    "title": "Open Saudi, Open Hearts, Open Doors",
    "role": "Frontend Developer",
    "employer": "Imagination",
    "client": "Kingdom of Saudi Arabia",
    "date": "September 2019",
    "heroPos": "56% 100%",
    "skills": "Angular, Scss, Storyblok CMS",
    "body": "<p>On September 27, 2019, the Kingdom of Saudi Arabia launched their E-Visa tourism program that allowed citizens of over 50 countries to travel to Saudi Arabia. As part of the launch, Imagination organized a dazzling multi-sensory event for VIPs, media, and influencers to experience the beauty, culture, and heritage the country has to offer.</p><p>Imagination offices across the world worked together to develop various pieces of the event, both digital and physical. The US office was tasked with the home website for the event, which served as both an attractor beforehand and a wrap-up afterwards.</p>",
    "sections": [
      {
        "layout": "image",
        "image": "image-1.png",
        "backgroundColor": "#191C23"
      },
      {
        "layout": "text",
        "title": "Technical Details",
        "body": "The website is an Angular application that’s fully responsive and cross-browser compatible. The website uses Storyblok as the CMS for all text and images and uses Amazon S3 for hosting. We built the site on a particularly tight timeline, with only 3 weeks for development and 1 week for QA. A true race-against-the-clock project!",
        "backgroundColor": "#EBECED",
        "textColor": "#667084"
      },
      {
        "layout": "background-image",
        "backgroundImage": "content-background.png",
        "backgroundPos": "center center"
      },
      {
        "layout": "video",
        "videoEmbed": "<div style='padding:56.25% 0 0 0;position:relative;'><iframe src='https://player.vimeo.com/video/372299919?h=620b041278&title=0&byline=0&portrait=0' style='position:absolute;top:0;left:0;width:100%;height:100%;' frameborder='0' allow='autoplay; fullscreen; picture-in-picture' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script>",
        "backgroundColor": "#EBECED"
      }
    ]
  },
  {
    "id": "canon-passport",
    "title": "Canon Passport Experience",
    "heroPos": "center 40%",
    "body": "<p>Canon’s Passport experience is an application used at live shows and events that allow participants to track their journey and save information as they visit different touchpoints on the stand. Users can simply scan their QR code and the visit is saved to their profile, which can later be accessed through their own personalized ‘souvenir site’. Additionally, to help guide participants through the digital experience, emails are sent out once they register, notify them of specific souvenirs they may have collected, and introduce them to their souvenir site once the show has ended.</p><p>The application was used for most Canon events from 2019-2020 , most notably the Consumer Electronics Show (2019 and 2020), the Albuquerque Balloon Fiesta (2019), and  the National Association of Broadcasters Show (2019).</p>",
    "skills": "Angular, Scss",
    "employer": "Imagination",
    "client": "Canon",
    "date": "May 2019 - February 2020",
    "role": "Frontend Developer, Onsite Support",
    "sections": [
      {
        "layout": "image",
        "image": "image-1.png",
        "backgroundColor": "#EBECED"
      },
      {
        "layout": "text",
        "title": "Xpkit Software Suite",
        "body": "Behind the passport experience is a suite of software services created by Imagination called Xpkit. This API framework is the bread and butter of the passport system, allowing businesses to connect every touchpoint across the customer journey, enabling them to measure, analyze, and improve every step using real-time data. All this data feeds into an analytics platform that’s used to visualize key metrics such as visitor numbers, dwell time, content views, and interactions.",
        "backgroundColor": "#191C23"
      }
    ]
  }
]